import pytest

from src.widget import get_date, mask_account_card

# Тест проверки функций mask_account_card, get_date модуля widget.py


# mask_account_card проверка функции
# фикстура
def test_f_mask_account_card(fix_mask_account_card):
    assert mask_account_card(fix_mask_account_card) == "Maestro 1596 83** **** 5199"


def test_f_mask_account_card_c(fix_mask_account_card_c):
    assert mask_account_card(fix_mask_account_card_c) == "Счет **5560"


# параметризация
@pytest.mark.parametrize(
    "value, expected",
    [
        ("Maestro 1596837868705199", "Maestro 1596 83** **** 5199"),
        ("Счет 64686473678894779589", "Счет **9589"),
        ("MasterCard 7158300734726758", "MasterCard 7158 30** **** 6758"),
        ("Счет 35383033474447895560", "Счет **5560"),
        ("Visa Classic 6831982476737658", "Visa Classic 6831 98** **** 7658"),
        ("Visa Platinum 8990922113665229", "Visa Platinum 8990 92** **** 5229"),
        ("Visa Gold 5999414228426353", "Visa Gold 5999 41** **** 6353"),
        ("Счет 73654108430135874305", "Счет **4305"),
        ("15968378705199", "Проверти, правильность ввода данных!"),
        ("159683786870519933455", "Проверти, правильность ввода данных!"),
        ("23373654108430135874305", "Проверти, правильность ввода данных!"),
        ("Maestro", "Проверти, правильность ввода данных!"),
        ("Счет", "Проверти, правильность ввода данных!"),
        ("", "Проверти, правильность ввода данных!"),
    ],
)
def test_mask_account_card(value, expected):
    assert mask_account_card(value) == expected


# mask_account_card проверка функции
# фикстура
def test_f_get_date(fix_get_date):
    assert get_date(fix_get_date) == "11.03.2024"


# параметризация
@pytest.mark.parametrize(
    "value, expected",
    [
        ("2024-03-11T02:26:18.671407", "11.03.2024"),
        ("2023-10-28T02:26:18.671407", "28.10.2023"),
        ("2023-17-28T02:26:18.671407", "Проверти, правильность ввода данных!"),
        ("2023-10-38T02:26:18.671407", "Проверти, правильность ввода данных!"),
        ("2024-0F-11T02:26:18.671407", "Проверти, правильность ввода данных!"),
        ("24-03-11T02:26:18.671407", "Проверти, правильность ввода данных!"),
        ("2024-03.11T02:26:18.671407", "Проверти, правильность ввода данных!"),
        ("2024-03-11", "Проверти, правильность ввода данных!"),
        ("2024-03-1102:26:18.671407", "Проверти, правильность ввода данных!"),
        ("2024-03-11T02:26:", "Проверти, правильность ввода данных!"),
        ("", "Проверти, правильность ввода данных!"),
    ],
)
def test_get_date(value, expected):
    assert get_date(value) == expected
